STMicroelectronics/x-cube-iota1/Drivers/BSPv2/B-L475E-IOT01/stm32l475e_iot01_bus.c
  if ((is_valid_speed != 0U) && (speed  <= (uint32_t) I2C_SPEED_FAST_PLUS))
  {
    i2cclk = DIV_ROUND_CLOSEST(NSEC_PER_SEC, clock_src_hz);
    i2cspeed = DIV_ROUND_CLOSEST(NSEC_PER_SEC, i2cfreq_hz);
    clk_error_prev = i2cspeed;

    /* Analog and Digital Filters */
    af_delay_min = (i2c_user_setup[speed].analog_filter == 1U) ? I2C_ANALOG_FILTER_DELAY_MIN : 0U;
    af_delay_max = (i2c_user_setup[speed].analog_filter == 1U) ? I2C_ANALOG_FILTER_DELAY_MAX : 0U;
    dnf_delay    = i2c_user_setup[speed].dnf * i2cclk;
    sdadel_min   = (int32_t) i2c_user_setup[speed].fall_time - (int32_t) i2c_specs[speed].hddat_min - (int32_t) af_delay_min - (((int32_t) i2c_user_setup[speed].dnf + 3) * (int32_t) i2cclk);
    sdadel_max   = (int32_t) i2c_specs[speed].vddat_max - (int32_t) i2c_user_setup[speed].rise_time - (int32_t) af_delay_max - (((int32_t) i2c_user_setup[speed].dnf + 4) * (int32_t) i2cclk);
    scldel_min   = (int32_t) i2c_user_setup[speed].rise_time + (int32_t) i2c_specs[speed].sudat_min;
    if (sdadel_min < 0)
    {
      sdadel_min = 0;
    }
    if (sdadel_max < 0)
    {
      sdadel_max = 0;
    }

    /* Compute possible values for PRESC, SCLDEL and SDADEL */
    for (p = 0; p < PRESC_MAX; p++)
    {
      for (l = 0; l < SCLDEL_MAX; l++)
      {
        int32_t scldel = ((int32_t) l + 1) * ((int32_t) p + 1) * (int32_t) i2cclk;
        if (scldel < scldel_min)
        {
          continue;
        }
        for (a = 0; a < SDADEL_MAX; a++)
        {
          int32_t sdadel = (((int32_t) a * ((int32_t) p + 1)) + 1) * (int32_t) i2cclk;
          if (((sdadel >= sdadel_min) && (sdadel <= sdadel_max))&& (p != p_prev))
          {
            valid_timing[valid_timing_nbr].presc = (uint8_t) p;
            valid_timing[valid_timing_nbr].scldel = (uint8_t) l;
            valid_timing[valid_timing_nbr].sdadel = (uint8_t) a;
            p_prev = p;
            valid_timing_nbr ++;
            if(valid_timing_nbr >= VALID_PRESC_NBR)
            {
              /* max valid timing buffer is full, use only these values*/
              goto Compute_scll_sclh;
            }
          }
        }
      }
    }

    if (valid_timing_nbr == 0U)
    {
      return 0;
    }

Compute_scll_sclh:
    tsync = af_delay_min + dnf_delay + (2U * i2cclk);
    s = NULL;
    clk_max = NSEC_PER_SEC / i2c_specs[speed].rate_min;
    clk_min = NSEC_PER_SEC / i2c_specs[speed].rate_max;

    /*
    * Among Prescaler possibilities discovered above figures out SCL Low
    * and High Period. Provided:
    * - SCL Low Period has to be higher than Low Period of tehs SCL Clock
    *   defined by I2C Specification. I2C Clock has to be lower than
    *   (SCL Low Period - Analog/Digital filters) / 4.
    * - SCL High Period has to be lower than High Period of the SCL Clock
    *   defined by I2C Specification
    * - I2C Clock has to be lower than SCL High Period
    */
    for (uint32_t count = 0; count < valid_timing_nbr; count++)
    {
      uint32_t prescaler = ((uint32_t) valid_timing[count].presc + 1U) * i2cclk;
      for (l = 0; l < SCLL_MAX; l++)
      {
        uint32_t tscl_l = (((uint32_t) l + 1U) * prescaler) + tsync;
        if ((tscl_l < i2c_specs[speed].l_min) || (i2cclk >= ((tscl_l - af_delay_min - dnf_delay) / 4U)))
        {
          continue;
        }
        for (h = 0; h < SCLH_MAX; h++)
        {
          uint32_t tscl_h = (((uint32_t) h + 1U) * prescaler) + tsync;
          uint32_t tscl = tscl_l + tscl_h + i2c_user_setup[speed].rise_time + i2c_user_setup[speed].fall_time;
          if ((tscl >= clk_min) && (tscl <= clk_max) && (tscl_h >= i2c_specs[speed].h_min) && (i2cclk < tscl_h))
          {
            int32_t clk_error = (int32_t) tscl - (int32_t) i2cspeed;
            if (clk_error < 0)
            {
              clk_error = -clk_error;
            }
            /* save the solution with the lowest clock error */
            if (clk_error < (int32_t) clk_error_prev)
            {
              clk_error_prev = (uint32_t) clk_error;
              valid_timing[count].scll = (uint8_t) l;
              valid_timing[count].sclh = (uint8_t) h;
              s = &valid_timing[count];
            }
          }
        }
      }
    }
    if (s == NULL)
    {
      return 0;
    }
    ret = (((uint32_t) s->presc & 0xFU) << 28) | (((uint32_t) s->scldel & 0xFU) << 20) | (((uint32_t) s->sdadel & 0xFU) << 16) | (((uint32_t) s->sclh & 0xFFU) << 8) | (((uint32_t) s->scll & 0xFFU) << 0);
  }
  
  return ret;
}

/**
  * @brief  Initialize SPI MSP.
  * @param  hSpi  SPI handle.
  * @retval None.
  */
static void SPI1_MspInit(SPI_HandleTypeDef* hSpi)
{
  GPIO_InitTypeDef  gpio_init_structure;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(hSpi);

  /*** Configure the GPIOs ***/
  /* Enable GPIO clock */
  BUS_SPI1_SCK_GPIO_CLK_ENABLE();
  BUS_SPI1_MOSI_GPIO_CLK_ENABLE();
  BUS_SPI1_MISO_GPIO_CLK_ENABLE();

  /* Configure SPI CLK as alternate function */
  gpio_init_structure.Pin       = BUS_SPI1_SCK_GPIO_PIN;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  gpio_init_structure.Alternate = BUS_SPI1_SCK_GPIO_AF;
  HAL_GPIO_Init(BUS_SPI1_SCK_GPIO_PORT, &gpio_init_structure);

  /* Configure SPI MOSI as alternate function */
  gpio_init_structure.Pin       = BUS_SPI1_MOSI_GPIO_PIN;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  gpio_init_structure.Alternate = BUS_SPI1_MOSI_GPIO_AF;
  HAL_GPIO_Init(BUS_SPI1_MOSI_GPIO_PORT, &gpio_init_structure);

  /* Configure SPI MISO as alternate function */
  gpio_init_structure.Pin       = BUS_SPI1_MISO_GPIO_PIN;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  gpio_init_structure.Alternate = BUS_SPI1_MISO_GPIO_AF;
  HAL_GPIO_Init(BUS_SPI1_MISO_GPIO_PORT, &gpio_init_structure);

